trade_exp/src/Documents/ДвижениеПрочихАктивовПассивов/ДвижениеПрочихАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="68d0f7ac-0b68-40e6-90e8-17570ee50f98">
  <name>ДвижениеПрочихАктивовПассивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="80f2d5f0-b8f8-403a-bd3b-7c69cd728c44">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4fad47f-bebe-4ff8-be48-42cf08a1ef8f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21ee686a-7053-4571-a797-a4c12b873723">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36334c31-25e3-4052-b198-7863f49c75e7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b699d93-f1fe-4bcd-982f-b4a413590ecf">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b2f1191-372c-4632-85f7-d94b82b9a32a">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8de8586-fc4b-426f-86f9-c58e59fbba63">
    <name>Увеличение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b257408b-7b28-479f-9dd1-f00bf8de2e4b">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8c4729a7-4460-451e-b492-3453abcdccef">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="96ff417a-9985-4071-a704-346686548c01">
    <name>ДанныеОтражения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e44536a8-3647-4ba9-8482-cb03c355aadc">
      <name>СтатьяИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9a096c28-546b-4c2c-8ec8-dd0ee2f9f1e8">
      <name>АналитикаДоходовИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cdf108ea-d8ab-467d-99a4-7ffbc93f922f">
      <name>ПодразделениеПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd69e151-9eab-459b-b127-61f729bd4b47">
      <name>АналитикаДоходовПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="88266ec6-413a-4638-9231-e8da29f0f42f">
      <name>НаправлениеДеятельностиПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e58d1f1c-2777-4593-8673-f12c56a856eb">
      <name>НаправлениеДеятельностиИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c62d4ad-db41-4686-bcfb-35c34101953a">
      <name>АналитикаРасходовИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84e8202d-2da0-4937-a966-f0e3228c465b">
      <name>ПодразделениеИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59de8cc3-e658-4676-b32c-937e532c1e41">
      <name>АналитикаАктивовПассивовИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="37fc4fb8-7239-4a04-a316-bbfa250fad31">
      <name>СтатьяПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a3c4a421-4422-49ca-a4c3-1799650db77d">
      <name>АналитикаАктивовПассивовПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dbcae4eb-73b3-47df-86f9-160274282fcb">
      <name>АналитикаРасходовПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d89606e0-9168-4716-a39c-8139ca16fe6a">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d468d759-4bad-4c5f-8949-707d6aa1e3f6">
      <name>СуммаБезНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cfe05a1d-24fa-4f82-868c-c9b9d07afc1d">
      <name>ДатаОтражения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c89cde9b-114d-4c36-b69e-cd64975354c3">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="121a31cd-7a12-494f-a3a0-1fea7eb13dea">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="18cd4e55-0355-4ef3-a854-8907c10c27a8">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="081628d3-428f-4893-b2de-8d0765b696c7">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="783414d1-df91-4956-9bcb-3afb073f0e04">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="637cc587-3a6c-4ebb-8fae-46f8f4fadd2b">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ТипыСтатейАктивовПассивов/ТипыСтатейАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5b25e409-9018-4736-8f00-d73849a0a99b">
  <name>ТипыСтатейАктивовПассивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b75a8513-db71-4836-9038-1ffa7691e427">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dd5c3761-0ed4-4e55-8c84-a0efd35185a0">
    <name>СтатьяАктивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="750389c4-d8ea-4d20-a0f1-c05c47b7ae71">
    <name>СтатьяПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8faa4da7-1f93-4afc-9a78-dcdd092aa635">
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ДвижениеПрочихАктивовПассивов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Получатель = Перечисления.ТипыСтатейАктивовПассивов.СтатьяПассивов и 
		Источник = Перечисления.ТипыСтатейАктивовПассивов.СтатьяРасходов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаТовары.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
			|	ТаблицаТовары.АналитикаРасходовИсточник КАК АналитикаРасходовИсточник,
			|	ТаблицаТовары.АналитикаАктивовПассивовИсточник КАК АналитикаАктивовПассивовИсточник,
			|	ТаблицаТовары.СтатьяИсточник КАК СтатьяИсточник,
			|	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
			|	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
			|	СУММА(ТаблицаТовары.Сумма) КАК Сумма
			|ИЗ
			|	Документ.ДвижениеПрочихАктивовПассивов.ДанныеОтражения КАК ТаблицаТовары
			|ГДЕ
			|	ТаблицаТовары.Ссылка = &Ссылка
			|	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаТовары.ПодразделениеПолучатель,
			|	ТаблицаТовары.АналитикаРасходовИсточник,
			|	ТаблицаТовары.АналитикаАктивовПассивовИсточник,
			|	ТаблицаТовары.СтатьяИсточник,
			|	ТаблицаТовары.ОбъектРасходов,
			|	ТаблицаТовары.АналитикаОбъекта";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.РасходыПоОбъектам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Подразделение = ВыборкаДетальныеЗаписи.ПодразделениеПолучатель;
			
			Если НЕ ВыборкаДетальныеЗаписи.АналитикаРасходовИсточник.Пустая() Тогда
				Движение.АналитикаРасходов = ВыборкаДетальныеЗаписи.АналитикаРасходовИсточник;
			КонецЕсли;
			
			Если НЕ ВыборкаДетальныеЗаписи.СтатьяИсточник.Пустая() Тогда
				Движение.СтатьяРасходов = ВыборкаДетальныеЗаписи.СтатьяИсточник;
			КонецЕсли; 
			
			Движение.ОбъектРасходов = ВыборкаДетальныеЗаписи.ОбъектРасходов;
			Движение.АналитикаОбъекта = ВыборкаДетальныеЗаписи.АналитикаОбъекта;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЦикла;
		Движения.РасходыПоОбъектам.Записывать = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ из ДанныеОтражения Цикл  
		
		Если НЕ СтрокаТЧ.ОбъектРасходов.Пустая() и СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Объект расходов"" заполнить, а ""Аналитика объекта"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.ДанныеОтражения[" + ИндексМассива + "].АналитикаОбъекта");
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ОбъектРасходов.Пустая() и НЕ СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Аналитика объекта"" заполнить, а ""Объект расходов"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.ДанныеОтражения[" + ИндексМассива + "].ОбъектРасходов");
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.ДанныеОтражения.Итог("Сумма");

КонецПроцедуры
#КонецЕсли
